neResEncoder.exe - вижинер конвертер для ресурсов с чексуммой и переменным кодовым словом.

Параметры командной строки (все параметры обязательные):
1. Полный путь к файлу
2. Расширение получаемомго файла без точки
3. Кодировать или декодировать ( encode/decode )
4. Кодовое слово

Примеры:

кодирование:
neResEncoder.exe d:/Work/MidnC/exe/assets/database/achievements.xml dat encode CodeWord

декодирование:
neResEncoder.exe d:/Work/MidnC/exe/assets/database/achievements.dat xml decode CodeWord


-------

encode.bat - кодирует все файлы с указанным расширением из текущей папки

Пример:
encode.bat xml dat

- xml - расширение файлов для кодирования
- dat - расширение, под которым сохраняются закодированные файлы


-------

decode.bat - раскодирует все файлы с указанным расширением из текущей папки

Пример:
decode.bat dat xml

- dat - расширение файлов для раскодирования
- xml - расширение, под которым сохраняются раскодированные файлы
